YourBook/app/models/user.rb

    def generate_unique_session_token
      while true
        token = SecureRandom.urlsafe_base64
        return token unless User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 AND "users"."id" != $2 LIMIT $3  [["session_token", "[FILTERED]"], ["id", 1], ["LIMIT", 1]]